In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([3, 6, 7, 2])

In [3]:
df

   0
0  3
1  6
2  7
3  2

In [4]:
df = pd.DataFrame([3, 6, 7, 2], index = list('abcd'))

In [5]:
df

   0
a  3
b  6
c  7
d  2

In [6]:
df = pd.DataFrame([['Ann',14],['Magdel',16],["Jeff", 14]])

In [7]:
df

        0   1
0     Ann  14
1  Magdel  16
2    Jeff  14

In [8]:
df = pd.DataFrame({'Name': ['Ann', 'Magdel', 'Jeff'], 'Age': [13, 16, 14]})

In [9]:
df

     Name  Age
0     Ann   13
1  Magdel   16
2    Jeff   14

In [10]:
df = pd.DataFrame({'Name': ['Ann', 'Magdel', 'Jeff'], 'Age': [13, 16, 14]}, index =['one', 'Two', 'Three'])

In [11]:
df

         Name  Age
one       Ann   13
Two    Magdel   16
Three    Jeff   14

In [12]:
df = pd. DataFrame([{'a':5, 'b': 7, 'c':8}, {'a': 15, 'c': 17,'d': 11},
                   {'a': 15, 'c': 17,'d': 11, 'e': 10}])

In [13]:
df

    a    b   c     d     e
0   5  7.0   8   NaN   NaN
1  15  NaN  17  11.0   NaN
2  15  NaN  17  11.0  10.0

In [14]:
df = pd. DataFrame([{'a':5, 'b': 7, 'c':8}, {'a': 15, 'c': 17,'d': 11},
                   {'a': 15, 'c': 17,'d': 11, 'e': 10}], 
                   index = ['First', 'Second', 'Third'], columns = ['a', 'b', 'c'])

In [15]:
df

         a    b   c
First    5  7.0   8
Second  15  NaN  17
Third   15  NaN  17

In [16]:
df['s'] = [30, 40, 50]

In [17]:
df

         a    b   c   s
First    5  7.0   8  30
Second  15  NaN  17  40
Third   15  NaN  17  50

In [18]:
del df['a']

In [19]:
df

          b   c   s
First   7.0   8  30
Second  NaN  17  40
Third   NaN  17  50

In [20]:
df['add'] = df ['b'] + df ['c']

In [21]:
df

          b   c   s   add
First   7.0   8  30  15.0
Second  NaN  17  40   NaN
Third   NaN  17  50   NaN

In [22]:
df.loc['First']

b       7.0
c       8.0
s      30.0
add    15.0
Name: First, dtype: float64

In [23]:
df.loc[:'Second']

          b   c   s   add
First   7.0   8  30  15.0
Second  NaN  17  40   NaN

In [24]:
df.iloc[0]

b       7.0
c       8.0
s      30.0
add    15.0
Name: First, dtype: float64

In [25]:
df.iloc[:2]

          b   c   s   add
First   7.0   8  30  15.0
Second  NaN  17  40   NaN

In [26]:
df['b']

First     7.0
Second    NaN
Third     NaN
Name: b, dtype: float64

In [27]:
df['c']

First      8
Second    17
Third     17
Name: c, dtype: int64

In [28]:
df

          b   c   s   add
First   7.0   8  30  15.0
Second  NaN  17  40   NaN
Third   NaN  17  50   NaN

In [29]:
df.iloc[1, 1]

17

In [30]:
df.iloc[1, 1:3]

c    17.0
s    40.0
Name: Second, dtype: float64

In [31]:
df = pd.DataFrame([[2, 4,], [5,6], [8, 9]], columns = ['a','b'])

In [32]:
df

   a  b
0  2  4
1  5  6
2  8  9

In [33]:
df2 = pd.DataFrame([[20, 40,], [50,60], [80, 90]], columns = ['a','b'])

In [34]:
df2

    a   b
0  20  40
1  50  60
2  80  90

In [35]:
df = df.append(df2)

In [36]:
df

    a   b
0   2   4
1   5   6
2   8   9
0  20  40
1  50  60
2  80  90

In [37]:
df = pd.DataFrame([[2, 4,], [5,6]], columns = ['a','b'])
df

   a  b
0  2  4
1  5  6

In [38]:
df2 = pd.DataFrame([[20, 40,], [50, 60]], columns = ['a','b'])
df2

    a   b
0  20  40
1  50  60

In [39]:
df = df.append(df2)
df

    a   b
0   2   4
1   5   6
0  20  40
1  50  60

In [40]:
df = pd.DataFrame([[20, 40,], [50,60], [80, 90]], columns = ['a','b'])

In [41]:
df

    a   b
0  20  40
1  50  60
2  80  90

In [42]:
df = df.drop(1)

In [43]:
df

    a   b
0  20  40
2  80  90

In [44]:
df2 = pd.DataFrame([[20, 40,], [50,60], [80, 90]],
                   index = ['one', 'two', 'three'], columns = ['a','b'])

In [45]:
df2

        a   b
one    20  40
two    50  60
three  80  90

In [46]:
df2 = df2.drop('one')

In [47]:
df2

        a   b
two    50  60
three  80  90

In [48]:
df

    a   b
0  20  40
2  80  90

In [49]:
 df.insert(1,'d', pd.Series([1,2]))

In [50]:
df

    a    d   b
0  20  1.0  40
2  80  NaN  90

In [51]:
df = pd.DataFrame({'Name': ['Ann', 'Magdel', 'Jeff'], 'Age': [13, 16, 14]})

In [52]:
df

     Name  Age
0     Ann   13
1  Magdel   16
2    Jeff   14

In [53]:
df.dtypes # Data type of each column

Name    object
Age      int64
dtype: object

In [54]:
df.shape

(3, 2)

In [55]:
df.size

6

In [56]:
df.head() # First n rows of dataframe

     Name  Age
0     Ann   13
1  Magdel   16
2    Jeff   14

In [57]:
df.tail() # Last n rows of dataframe

     Name  Age
0     Ann   13
1  Magdel   16
2    Jeff   14

In [58]:
df = pd.DataFrame({'Name': pd.Series(['Magdel', 'Hazel', 'Jeff', 'Jeryl', 'Ann', 'Jack']),
                   'Age': pd.Series([17, 13, 14, 13, 18, 19]),
                   'Weight': pd.Series([48, 38, 49, 34, 54, 59]), 'Height': [150, 140, 160, 155, 170, 174]})

In [59]:
df

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   13      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [60]:
df = pd.DataFrame({'Name': ['Magdel', 'Hazel', 'Jeff', 'Jeryl', 'Ann', 'Jack'],
                   'Age': [17, 13, 14, 13, 18, 19],
                   'Weight': [48, 38, 49, 34, 54, 59], 
                   'Height': [150, 140, 160, 155, 170, 174]})

In [61]:
df

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   13      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [62]:
df.dtypes

Name      object
Age        int64
Weight     int64
Height     int64
dtype: object

In [63]:
df.ndim

2

In [64]:
df.size

24

In [65]:
df.shape

(6, 4)

In [66]:
df.head()

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   13      34     155
4     Ann   18      54     170

In [67]:
df.head(6)

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   13      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [68]:
df.tail()

    Name  Age  Weight  Height
1  Hazel   13      38     140
2   Jeff   14      49     160
3  Jeryl   13      34     155
4    Ann   18      54     170
5   Jack   19      59     174

In [69]:
df.tail(10)

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   13      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [70]:
df.sum()

Name      MagdelHazelJeffJerylAnnJack
Age                                94
Weight                            282
Height                            949
dtype: object

In [71]:
df.sum(1)

0    215
1    191
2    223
3    202
4    242
5    252
dtype: int64

In [72]:
df.mean()

Age        15.666667
Weight     47.000000
Height    158.166667
dtype: float64

In [73]:
df.mean(1)

0    71.666667
1    63.666667
2    74.333333
3    67.333333
4    80.666667
5    84.000000
dtype: float64

In [74]:
df.std()

Age        2.658320
Weight     9.465728
Height    12.655697
dtype: float64

In [75]:
df.std(1)

0    69.586876
1    67.278030
2    76.225543
3    76.644200
4    79.431312
5    80.467385
dtype: float64

In [76]:
df.median()

Age        15.5
Weight     48.5
Height    157.5
dtype: float64

In [77]:
df.median(1)

0    48.0
1    38.0
2    49.0
3    34.0
4    54.0
5    59.0
dtype: float64

In [78]:
df.max()

Name      Magdel
Age           19
Weight        59
Height       174
dtype: object

In [79]:
df.min()

Name      Ann
Age        13
Weight     34
Height    140
dtype: object

In [80]:
df.describe()

             Age     Weight      Height
count   6.000000   6.000000    6.000000
mean   15.666667  47.000000  158.166667
std     2.658320   9.465728   12.655697
min    13.000000  34.000000  140.000000
25%    13.250000  40.500000  151.250000
50%    15.500000  48.500000  157.500000
75%    17.750000  52.750000  167.500000
max    19.000000  59.000000  174.000000

In [81]:
df = df.sort_index()

In [82]:
df

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   13      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [83]:
df = pd.DataFrame({'Name': ['Magdel', 'Hazel', 'Jeff', 'Jeryl', 'Ann', 'Jack'],
                   'Age': [17, 13, 14, 16, 18, 19],
                   'Weight': [48, 38, 49, 34, 54, 59], 
                   'Height': [150, 140, 160, 155, 170, 174]})

In [84]:
df

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   16      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [85]:
df.shape

(6, 4)

In [86]:
df.size

24

In [87]:
df.head(10)

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   16      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [88]:
df.min(1)

0    17
1    13
2    14
3    16
4    18
5    19
dtype: int64

In [89]:
df.describe()

             Age     Weight      Height
count   6.000000   6.000000    6.000000
mean   16.166667  47.000000  158.166667
std     2.316607   9.465728   12.655697
min    13.000000  34.000000  140.000000
25%    14.500000  40.500000  151.250000
50%    16.500000  48.500000  157.500000
75%    17.750000  52.750000  167.500000
max    19.000000  59.000000  174.000000

In [90]:
df

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160
3   Jeryl   16      34     155
4     Ann   18      54     170
5    Jack   19      59     174

In [91]:
df = pd.DataFrame({'Name': ['Magdel', 'Hazel', 'Jeff', 'Jeryl', 'Ann', 'Jack'],
                   'Age': [17, 13, 14, 16, 18, 19],
                   'Weight': [48, 38, 49, 34, 54, 59], 
                   'Height': [150, 140, 160, 155, 170, 174]},index = [7,3,9,2,11,8])

In [92]:
df

      Name  Age  Weight  Height
7   Magdel   17      48     150
3    Hazel   13      38     140
9     Jeff   14      49     160
2    Jeryl   16      34     155
11     Ann   18      54     170
8     Jack   19      59     174

In [93]:
df

      Name  Age  Weight  Height
7   Magdel   17      48     150
3    Hazel   13      38     140
9     Jeff   14      49     160
2    Jeryl   16      34     155
11     Ann   18      54     170
8     Jack   19      59     174

In [94]:
df= df.sort_index()

In [95]:
df

      Name  Age  Weight  Height
2    Jeryl   16      34     155
3    Hazel   13      38     140
7   Magdel   17      48     150
8     Jack   19      59     174
9     Jeff   14      49     160
11     Ann   18      54     170